// ===================================================
// 常量,枚举,键值对定义 提供给所有或某些模块使用
// ===================================================

factory.enum = {};
/**
 * 验证类型.每个类型对应一个完成验证功能的函数
 */
factory.enum.vType = {
    // 必要项且不能为空或空白字符
    'notnull': 'isNotNull',
    // 电子邮件格式
    'email': 'isEmail',
    // 国内手机号1[34578]\d{9}
    'mobile': 'isMobile',
    // 限26个英文,大小写不限.
    'abc': 'isAbc',
    // 限0-9数字
    '123': 'isDigit',
    // 限26个英文字母(开头)和0-9整数(可选)
    'abc123': 'isAbcDigit',
    // 限26个英文字母和0-9整数(可选)和_下划线(可选),并且是字母或者下划线开头.
    'abc_123': 'isAbcDigitUline',
    // 限url
    'url': 'isUrl',
    // 标准日期 "1999-02-28 12:08:33"
    'date': 'isDate',
    // 是否超长度限制
    'maxlen': 'isMaxLength',
    // 是否小于长度
    'minlen': 'isMinLength',
    // 正整数或正1-2位小数
    'money': "isMoney"
};